import random

nouns = ['арбуз', 'ковер', 'кресло', 'обруч', 'тыква', 'бинт', 'женщина', 'книга', 'кран', 'красота', 'касторка', 'комбинат', 'бомба', 'мальчик', 'крановщик', 'палач', 'сварщик', 'помещение', 'тендер', 'участок']
adjectives = ['сильный', 'мощный', 'аппетитный', 'ковровый', 'большой', 'умный', 'красивый', 'земельный', 'путинский']
adverbs = ['быстро', 'сильно', 'звонко', 'дичайше', 'уверенно', 'изредка', 'потихоньку', 'медленно', 'заметно']
prepositions = ['на', 'под', 'через', 'вокруг', 'над', 'по', 'около']
verbs = ['бросил', 'прочитал', 'крикнул', 'обвел', 'чихнул', 'услышал', 'аннигилировать', 'повелевать', 'плевать', 'разделять', 'властвовать', 'молчать', 'кричать', 'ухать', 'поговаривать']

words = [nouns, adjectives, adverbs, prepositions, verbs]

result = ''

length = int(input('Введите длину предложения: '))

to_use = [0, 1, 2, 3, 4]

for i in range(length):
	part = random.choice(to_use)

	if(part == 0):
		to_use = [2, 3, 4]
	elif(part == 1):
		to_use = [0]
	elif(part == 2):
		to_use = [4]
	elif(part == 3):
		to_use = [0, 1]
	elif(part == 4):
		to_use = [0, 1, 2, 3]

	word = random.choice(words[part])

	result += word + ' '

print(result)